benchmark/1000000-requests/1000-concurrent-with-dpdk/results.txt
====== SET ======
  1000000 requests completed in 14.88 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.487 milliseconds (cumulative count 1)
50.000% <= 7.695 milliseconds (cumulative count 500668)
75.000% <= 9.407 milliseconds (cumulative count 750560)
87.500% <= 12.207 milliseconds (cumulative count 875187)
93.750% <= 14.007 milliseconds (cumulative count 937583)
96.875% <= 17.919 milliseconds (cumulative count 968793)
98.438% <= 21.599 milliseconds (cumulative count 984380)
99.219% <= 24.863 milliseconds (cumulative count 992192)
99.609% <= 29.167 milliseconds (cumulative count 996097)
99.805% <= 32.671 milliseconds (cumulative count 998071)
99.902% <= 34.239 milliseconds (cumulative count 999035)
99.951% <= 37.119 milliseconds (cumulative count 999525)
99.976% <= 38.143 milliseconds (cumulative count 999758)
99.988% <= 38.559 milliseconds (cumulative count 999882)
99.994% <= 39.167 milliseconds (cumulative count 999939)
99.997% <= 39.807 milliseconds (cumulative count 999974)
99.998% <= 39.967 milliseconds (cumulative count 999990)
99.999% <= 39.999 milliseconds (cumulative count 1000000)
100.000% <= 39.999 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.006% <= 3.103 milliseconds (cumulative count 65)
0.011% <= 4.103 milliseconds (cumulative count 111)
0.073% <= 5.103 milliseconds (cumulative count 726)
6.319% <= 6.103 milliseconds (cumulative count 63186)
29.645% <= 7.103 milliseconds (cumulative count 296454)
58.595% <= 8.103 milliseconds (cumulative count 585949)
72.513% <= 9.103 milliseconds (cumulative count 725133)
79.287% <= 10.103 milliseconds (cumulative count 792865)
83.155% <= 11.103 milliseconds (cumulative count 831549)
87.001% <= 12.103 milliseconds (cumulative count 870006)
91.177% <= 13.103 milliseconds (cumulative count 911773)
93.891% <= 14.103 milliseconds (cumulative count 938906)
94.845% <= 15.103 milliseconds (cumulative count 948448)
95.781% <= 16.103 milliseconds (cumulative count 957808)
96.422% <= 17.103 milliseconds (cumulative count 964223)
96.998% <= 18.111 milliseconds (cumulative count 969975)
97.540% <= 19.103 milliseconds (cumulative count 975396)
97.953% <= 20.111 milliseconds (cumulative count 979527)
98.288% <= 21.103 milliseconds (cumulative count 982883)
98.618% <= 22.111 milliseconds (cumulative count 986178)
98.825% <= 23.103 milliseconds (cumulative count 988252)
99.087% <= 24.111 milliseconds (cumulative count 990866)
99.257% <= 25.103 milliseconds (cumulative count 992567)
99.410% <= 26.111 milliseconds (cumulative count 994101)
99.525% <= 27.103 milliseconds (cumulative count 995247)
99.571% <= 28.111 milliseconds (cumulative count 995707)
99.607% <= 29.103 milliseconds (cumulative count 996066)
99.666% <= 30.111 milliseconds (cumulative count 996661)
99.714% <= 31.103 milliseconds (cumulative count 997143)
99.748% <= 32.111 milliseconds (cumulative count 997478)
99.846% <= 33.119 milliseconds (cumulative count 998456)
99.892% <= 34.111 milliseconds (cumulative count 998919)
99.919% <= 35.103 milliseconds (cumulative count 999190)
99.933% <= 36.127 milliseconds (cumulative count 999333)
99.953% <= 37.119 milliseconds (cumulative count 999525)
99.975% <= 38.111 milliseconds (cumulative count 999755)
99.993% <= 39.103 milliseconds (cumulative count 999931)
100.000% <= 40.127 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 67195.27 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        8.887     2.480     7.695    15.295    23.823    39.999
====== GET ======
  1000000 requests completed in 14.02 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.895 milliseconds (cumulative count 1)
50.000% <= 6.887 milliseconds (cumulative count 500011)
75.000% <= 7.687 milliseconds (cumulative count 751283)
87.500% <= 8.359 milliseconds (cumulative count 875845)
93.750% <= 9.015 milliseconds (cumulative count 937895)
96.875% <= 9.623 milliseconds (cumulative count 968833)
98.438% <= 10.191 milliseconds (cumulative count 984377)
99.219% <= 10.663 milliseconds (cumulative count 992236)
99.609% <= 11.231 milliseconds (cumulative count 996117)
99.805% <= 11.783 milliseconds (cumulative count 998048)
99.902% <= 12.295 milliseconds (cumulative count 999030)
99.951% <= 12.591 milliseconds (cumulative count 999521)
99.976% <= 12.759 milliseconds (cumulative count 999760)
99.988% <= 13.087 milliseconds (cumulative count 999878)
99.994% <= 13.407 milliseconds (cumulative count 999939)
99.997% <= 13.535 milliseconds (cumulative count 999977)
99.998% <= 13.599 milliseconds (cumulative count 999985)
99.999% <= 13.783 milliseconds (cumulative count 999993)
100.000% <= 13.903 milliseconds (cumulative count 999998)
100.000% <= 13.919 milliseconds (cumulative count 999999)
100.000% <= 13.935 milliseconds (cumulative count 1000000)
100.000% <= 13.935 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 3.103 milliseconds (cumulative count 10)
0.028% <= 4.103 milliseconds (cumulative count 284)
1.186% <= 5.103 milliseconds (cumulative count 11860)
20.097% <= 6.103 milliseconds (cumulative count 200968)
57.677% <= 7.103 milliseconds (cumulative count 576766)
83.582% <= 8.103 milliseconds (cumulative count 835816)
94.334% <= 9.103 milliseconds (cumulative count 943335)
98.261% <= 10.103 milliseconds (cumulative count 982606)
99.554% <= 11.103 milliseconds (cumulative count 995543)
99.870% <= 12.103 milliseconds (cumulative count 998703)
99.988% <= 13.103 milliseconds (cumulative count 999881)
100.000% <= 14.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 71311.42 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        7.051     2.888     6.887     9.215    10.511    13.935