benchmark/1000000-requests/1000-concurrent-with-dpdk/results.txt
====== SET ======
  1000000 requests completed in 17.17 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 7.663 milliseconds (cumulative count 2)
50.000% <= 16.815 milliseconds (cumulative count 501838)
75.000% <= 17.519 milliseconds (cumulative count 753093)
87.500% <= 18.335 milliseconds (cumulative count 876072)
93.750% <= 19.327 milliseconds (cumulative count 938055)
96.875% <= 20.687 milliseconds (cumulative count 968829)
98.438% <= 22.287 milliseconds (cumulative count 984395)
99.219% <= 24.239 milliseconds (cumulative count 992222)
99.609% <= 25.231 milliseconds (cumulative count 996117)
99.805% <= 26.559 milliseconds (cumulative count 998067)
99.902% <= 27.423 milliseconds (cumulative count 999030)
99.951% <= 30.255 milliseconds (cumulative count 999513)
99.976% <= 31.583 milliseconds (cumulative count 999757)
99.988% <= 32.799 milliseconds (cumulative count 999885)
99.994% <= 33.215 milliseconds (cumulative count 999944)
99.997% <= 33.311 milliseconds (cumulative count 999981)
99.998% <= 33.343 milliseconds (cumulative count 999988)
99.999% <= 33.407 milliseconds (cumulative count 999993)
100.000% <= 33.663 milliseconds (cumulative count 999997)
100.000% <= 33.887 milliseconds (cumulative count 999999)
100.000% <= 34.207 milliseconds (cumulative count 1000000)
100.000% <= 34.207 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.010% <= 8.103 milliseconds (cumulative count 97)
0.026% <= 9.103 milliseconds (cumulative count 256)
0.045% <= 10.103 milliseconds (cumulative count 452)
0.065% <= 11.103 milliseconds (cumulative count 645)
0.080% <= 12.103 milliseconds (cumulative count 804)
0.088% <= 13.103 milliseconds (cumulative count 883)
0.128% <= 14.103 milliseconds (cumulative count 1276)
0.696% <= 15.103 milliseconds (cumulative count 6960)
16.101% <= 16.103 milliseconds (cumulative count 161007)
62.556% <= 17.103 milliseconds (cumulative count 625558)
85.192% <= 18.111 milliseconds (cumulative count 851922)
92.843% <= 19.103 milliseconds (cumulative count 928434)
95.770% <= 20.111 milliseconds (cumulative count 957697)
97.468% <= 21.103 milliseconds (cumulative count 974682)
98.365% <= 22.111 milliseconds (cumulative count 983651)
98.736% <= 23.103 milliseconds (cumulative count 987364)
99.146% <= 24.111 milliseconds (cumulative count 991461)
99.571% <= 25.103 milliseconds (cumulative count 995714)
99.752% <= 26.111 milliseconds (cumulative count 997525)
99.885% <= 27.103 milliseconds (cumulative count 998851)
99.921% <= 28.111 milliseconds (cumulative count 999208)
99.935% <= 29.103 milliseconds (cumulative count 999348)
99.950% <= 30.111 milliseconds (cumulative count 999497)
99.969% <= 31.103 milliseconds (cumulative count 999691)
99.982% <= 32.111 milliseconds (cumulative count 999816)
99.993% <= 33.119 milliseconds (cumulative count 999930)
100.000% <= 34.111 milliseconds (cumulative count 999999)
100.000% <= 35.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 58254.69 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       17.136     7.656    16.815    19.759    23.743    34.207
====== GET ======
  1000000 requests completed in 14.53 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.087 milliseconds (cumulative count 2)
50.000% <= 7.447 milliseconds (cumulative count 500217)
75.000% <= 8.327 milliseconds (cumulative count 751037)
87.500% <= 9.239 milliseconds (cumulative count 875190)
93.750% <= 10.055 milliseconds (cumulative count 937924)
96.875% <= 10.847 milliseconds (cumulative count 969020)
98.438% <= 11.591 milliseconds (cumulative count 984497)
99.219% <= 12.431 milliseconds (cumulative count 992192)
99.609% <= 13.223 milliseconds (cumulative count 996099)
99.805% <= 14.287 milliseconds (cumulative count 998049)
99.902% <= 16.175 milliseconds (cumulative count 999025)
99.951% <= 17.743 milliseconds (cumulative count 999518)
99.976% <= 18.623 milliseconds (cumulative count 999757)
99.988% <= 18.975 milliseconds (cumulative count 999894)
99.994% <= 19.119 milliseconds (cumulative count 999939)
99.997% <= 19.295 milliseconds (cumulative count 999973)
99.998% <= 19.375 milliseconds (cumulative count 999985)
99.999% <= 19.599 milliseconds (cumulative count 999993)
100.000% <= 19.775 milliseconds (cumulative count 999997)
100.000% <= 19.903 milliseconds (cumulative count 999999)
100.000% <= 20.271 milliseconds (cumulative count 1000000)
100.000% <= 20.271 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.000% <= 2.103 milliseconds (cumulative count 4)
0.015% <= 3.103 milliseconds (cumulative count 151)
0.027% <= 4.103 milliseconds (cumulative count 273)
0.090% <= 5.103 milliseconds (cumulative count 901)
16.268% <= 6.103 milliseconds (cumulative count 162684)
42.976% <= 7.103 milliseconds (cumulative count 429764)
68.910% <= 8.103 milliseconds (cumulative count 689100)
86.185% <= 9.103 milliseconds (cumulative count 861852)
94.073% <= 10.103 milliseconds (cumulative count 940732)
97.594% <= 11.103 milliseconds (cumulative count 975944)
98.982% <= 12.103 milliseconds (cumulative count 989824)
99.538% <= 13.103 milliseconds (cumulative count 995378)
99.787% <= 14.103 milliseconds (cumulative count 997872)
99.836% <= 15.103 milliseconds (cumulative count 998362)
99.900% <= 16.103 milliseconds (cumulative count 999001)
99.932% <= 17.103 milliseconds (cumulative count 999321)
99.960% <= 18.111 milliseconds (cumulative count 999596)
99.994% <= 19.103 milliseconds (cumulative count 999937)
100.000% <= 20.111 milliseconds (cumulative count 999999)
100.000% <= 21.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 68804.18 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        7.573     2.080     7.447    10.287    12.127    20.271